[Killed] ConditionalExpression
src/transcriptService.ts:89:42
     getGrade(studentID: StudentID, studentName: StudentName, courseID: CourseID): Grade {
         const index = this.getIndex(studentID, studentName)
         const courses = this.transcripts[index].courses; 
-        const course = courses.find(c => c.courseID === courseID);
+        const course = courses.find(c => true);
         if (!course) {
             throw new Error(`Course with ID ${courseID} not found for student ${studentName} (ID: ${studentID})`);
killedBy: getGrade error handling should throw an error if the course is not found (covers line 91)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Course with ID CS4100 not found for student Alice (ID: 1)"

Received function did not throw

[Killed] ConditionalExpression
src/transcriptService.ts:109:13
 
     getGPA(studentID: StudentID, studentName: StudentName): number {
         const transcript = this.getTranscript(studentID, studentName);
-        if (transcript.courses.length === 0) {
+        if (false) {
             throw new Error("No courses found for GPA calculation");
         }
killedBy: getGPA error handling should throw an error if student has no courses (covers line 110)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No courses found for GPA calculation"

Received function did not throw
